#!/bin/bash


#запуск через терминал в папке с обрабатываемой директорией: ./run.sh <путь к папке>


#  Фиксируем рабочую папку, из которой запустили скрипт
cd "$PWD"

#  Выводим в консоль
echo "=========================================="
echo "ЗАПУСК СКРИПТА: $(date '%Y-%m-%d %H:%M:%S')"
echo "Текущая рабочая директория: $PWD"
echo "=========================================="

# Запускаем Python.
python main.py "$1" 

echo "=========================================="
echo "РАБОТА СКРИПТА ЗАВЕРШЕНА: $(date '%Y-%m-%d %H:%M:%S')"
echo "=========================================="

